---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFailuresPreprocessor
source: html/ebcf68ee-d067-3fd5-459b-9202107ac36d.htm
---
# IFailuresPreprocessor Members

This method is called when there have been failures found at the end of a transaction and Revit is about to start processing them.